docs/imagens/proxy.mmd
  sequenceDiagram

    autonumber

    Navegador ->> Proxy: requisição
    Proxy ->> Servidor: encaminha requisição
    Servidor -->> Proxy: resposta
    Proxy -->> Navegador: encaminha resposta
